<?php
if($_POST["CATEGORIE"]!="----" and $_POST["ECHELON"]!="----" and $_POST["DUREE"]!="----" and $_POST["SF"]!="----")
{
//conge maladie grh
require_once('../tcpdf/config/lang/eng.php');
require_once('../tcpdf/tcpdf.php');
//FONCTION QUI CALCULE POINT INDICIERE bien verifier pour la copie paie pas encor verifier contient des erreures 
function gs($h,$v) 
{ 
$gs = array(); 

$gs['1']['c']   =1 ;
$gs['1']['ifc'] =3200 ;
$gs['1']['i'] =200 ;
$gs['1']['0'] =0 ;   
$gs['1']['1'] =10 ;  
$gs['1']['2'] =20 ;  
$gs['1']['3'] =30 ;  
$gs['1']['4'] =40 ;  
$gs['1']['5'] =50 ;  
$gs['1']['6'] =60 ;  
$gs['1']['7'] =70 ;  
$gs['1']['8'] =80 ;  
$gs['1']['9'] =90 ;  
$gs['1']['10'] =100 ;  
$gs['1']['11'] =110 ;  
$gs['1']['12'] =120 ; 
//********************// 
$gs['2']['c'] =2 ;
$gs['2']['ifc'] =3200 ;
$gs['2']['i'] =219 ; 
$gs['2']['0'] =0 ;  
$gs['2']['1'] =11 ;  
$gs['2']['2'] =22 ;  
$gs['2']['3'] =33 ;  
$gs['2']['4'] =44 ;  
$gs['2']['5'] =55 ;  
$gs['2']['6'] =66 ;  
$gs['2']['7'] =77 ;  
$gs['2']['8'] =88 ;  
$gs['2']['9'] =99 ;  
$gs['2']['10'] =110 ;  
$gs['2']['11'] =120 ;  
$gs['2']['12'] =131 ; 
//********************// 
$gs['3']['c'] =3 ;
$gs['3']['ifc'] =3200 ;
$gs['3']['i'] =240 ;
$gs['3']['0'] =0 ;  
$gs['3']['1'] =12 ;  
$gs['3']['2'] =24 ;  
$gs['3']['3'] =36 ;  
$gs['3']['4'] =48 ;  
$gs['3']['5'] =60 ;  
$gs['3']['6'] =72 ;  
$gs['3']['7'] =84 ;  
$gs['3']['8'] =96 ;  
$gs['3']['9'] =108 ;  
$gs['3']['10'] =120 ;  
$gs['3']['11'] =132 ;  
$gs['3']['12'] =144 ;
//********************//
$gs['4']['c'] =4 ;
$gs['4']['ifc'] =3200 ;
$gs['4']['i'] =263 ;
$gs['4']['0'] =0 ; 
$gs['4']['1'] =13 ;  
$gs['4']['2'] =26 ;  
$gs['4']['3'] =39 ;  
$gs['4']['4'] =53 ;  
$gs['4']['5'] =66 ;  
$gs['4']['6'] =79 ;  
$gs['4']['7'] =92 ;  
$gs['4']['8'] =105 ;  
$gs['4']['9'] =118 ;  
$gs['4']['10'] =132 ;  
$gs['4']['11'] =145 ;  
$gs['4']['12'] =158 ;
//*******************//
$gs['5']['c'] =5 ;
$gs['5']['ifc'] =3200 ;
$gs['5']['i'] =288 ; 
$gs['5']['0'] =0 ;  
$gs['5']['1'] =14 ;  
$gs['5']['2'] =29 ;  
$gs['5']['3'] =43 ;  
$gs['5']['4'] =58 ;  
$gs['5']['5'] =72 ;  
$gs['5']['6'] =86 ;  
$gs['5']['7'] =101 ;  
$gs['5']['8'] =115 ;  
$gs['5']['9'] =130 ;  
$gs['5']['10'] =144 ;  
$gs['5']['11'] =158 ;  
$gs['5']['12'] =173 ;
//********************//
$gs['6']['ifc'] =3200 ;
$gs['6']['c'] =6 ;
$gs['6']['i'] =315 ;
$gs['6']['0'] =0 ;  
$gs['6']['1'] =16 ;  
$gs['6']['2'] =32 ;  
$gs['6']['3'] =47 ;  
$gs['6']['4'] =63 ;  
$gs['6']['5'] =79 ;  
$gs['6']['6'] =95 ;  
$gs['6']['7'] =110 ;  
$gs['6']['8'] =126 ;  
$gs['6']['9'] =142 ;  
$gs['6']['10'] =158 ;  
$gs['6']['11'] =173 ;  
$gs['6']['12'] =189 ;
//********************//
$gs['7']['c'] =7 ;
$gs['7']['ifc'] =2500 ;
$gs['7']['i'] =348 ;
$gs['7']['0'] =0 ;   
$gs['7']['1'] =17 ;  
$gs['7']['2'] =35 ;  
$gs['7']['3'] =52 ;  
$gs['7']['4'] =70 ;  
$gs['7']['5'] =87 ;  
$gs['7']['6'] =104 ;  
$gs['7']['7'] =122 ;  
$gs['7']['8'] =139 ;  
$gs['7']['9'] =157 ;  
$gs['7']['10'] =174 ;  
$gs['7']['11'] =191 ;  
$gs['7']['12'] =209 ;
//********************//
$gs['8']['c'] =8 ;
$gs['8']['ifc'] =2500 ;
$gs['8']['i'] =379 ;
$gs['8']['0'] =0 ; 
$gs['8']['1'] =19 ;  
$gs['8']['2'] =38 ;  
$gs['8']['3'] =57 ;  
$gs['8']['4'] =76 ;  
$gs['8']['5'] =95 ;  
$gs['8']['6'] =114 ;  
$gs['8']['7'] =133 ;  
$gs['8']['8'] =152 ;  
$gs['8']['9'] =171 ;  
$gs['8']['10'] =190 ;  
$gs['8']['11'] =208 ;  
$gs['8']['12'] =225 ;
//********************//
$gs['9']['c'] =9 ;
$gs['9']['ifc'] =2000 ;
$gs['9']['i'] =418 ;  
$gs['9']['0'] =0 ; 
$gs['9']['1'] =21 ; 
$gs['9']['2'] =42 ;  
$gs['9']['3'] =63 ;  
$gs['9']['4'] =84 ;  
$gs['9']['5'] =105 ;  
$gs['9']['6'] =125 ;  
$gs['9']['7'] =146 ;  
$gs['9']['8'] =167 ;  
$gs['9']['9'] =188 ;  
$gs['9']['10'] =209 ;  
$gs['9']['11'] =230 ;  
$gs['9']['12'] =251 ;
//********************//
$gs['10']['c'] =10 ;
$gs['10']['ifc'] =2000 ;
$gs['10']['i'] =453 ; 
$gs['10']['0'] =0 ; 
$gs['10']['1'] =23 ;  
$gs['10']['2'] =45 ;  
$gs['10']['3'] =68 ;  
$gs['10']['4'] =91 ;  
$gs['10']['5'] =113 ;  
$gs['10']['6'] =136 ;  
$gs['10']['7'] =159 ;  
$gs['10']['8'] =181 ;  
$gs['10']['9'] =204 ;  
$gs['10']['10'] =227 ;  
$gs['10']['11'] =249 ;  
$gs['10']['12'] =272 ;
//********************//
$gs['11']['c'] =11 ;
$gs['11']['ifc'] =1500 ;
$gs['11']['i'] =498 ;
$gs['11']['0'] =0 ;   
$gs['11']['1'] =25 ;  
$gs['11']['2'] =50 ;  
$gs['11']['3'] =75 ;  
$gs['11']['4'] =100 ;  
$gs['11']['5'] =125 ;  
$gs['11']['6'] =149 ;  
$gs['11']['7'] =174 ;  
$gs['11']['8'] =199 ;  
$gs['11']['9'] =224 ;  
$gs['11']['10'] =249 ;  
$gs['11']['11'] =274 ;  
$gs['11']['12'] =299 ;
//********************//
$gs['12']['c'] =12 ;
$gs['12']['ifc'] =1500 ;
$gs['12']['i'] =537 ; 
$gs['12']['0'] =0 ; 
$gs['12']['1'] =27 ;  
$gs['12']['2'] =54 ;  
$gs['12']['3'] =81 ;  
$gs['12']['4'] =107 ;  
$gs['12']['5'] =134 ;  
$gs['12']['6'] =161 ;  
$gs['12']['7'] =188 ;  
$gs['12']['8'] =215 ;  
$gs['12']['9'] =242 ;  
$gs['12']['10'] =269 ;  
$gs['12']['11'] =295 ;  
$gs['12']['12'] =322 ;
//********************//
$gs['13']['c'] =13 ;
$gs['13']['ifc'] =1500 ;
$gs['13']['i'] =578 ; 
$gs['13']['0'] =0; 
$gs['13']['1'] =29;  
$gs['13']['2'] =58 ;  
$gs['13']['3'] =87 ;  
$gs['13']['4'] =116 ;  
$gs['13']['5'] =145 ;  
$gs['13']['6'] =173 ;  
$gs['13']['7'] =202 ;  
$gs['13']['8'] =231 ;  
$gs['13']['9'] =260 ;  
$gs['13']['10'] =289 ;  
$gs['13']['11'] =318 ;  
$gs['13']['12'] =347 ;
//********************//
$gs['14']['c'] =14 ;
$gs['14']['ifc'] =1500 ;
$gs['14']['i'] =621 ; 
$gs['14']['0'] =0; 
$gs['14']['1'] =31;  
$gs['14']['2'] =62 ;  
$gs['14']['3'] =93 ;  
$gs['14']['4'] =124 ;  
$gs['14']['5'] =155 ;  
$gs['14']['6'] =186 ;  
$gs['14']['7'] =217 ;  
$gs['14']['8'] =248 ;  
$gs['14']['9'] =279 ;  
$gs['14']['10'] =311 ;  
$gs['14']['11'] =342 ;  
$gs['14']['12'] =373 ;
//********************//
$gs['15']['c'] =15 ;
$gs['15']['ifc'] =1500 ;
$gs['15']['i'] =666 ;
$gs['15']['0'] =0;  
$gs['15']['1'] =33;  
$gs['15']['2'] =67 ;  
$gs['15']['3'] =100 ;  
$gs['15']['4'] =133 ;  
$gs['15']['5'] =167 ;  
$gs['15']['6'] =200 ;  
$gs['15']['7'] =233 ;  
$gs['15']['8'] =266 ;  
$gs['15']['9'] =300 ;  
$gs['15']['10'] =333 ;  
$gs['15']['11'] =366 ;  
$gs['15']['12'] =400 ;
//********************//
$gs['16']['c'] =16 ;
$gs['16']['ifc'] =1500 ;
$gs['16']['i'] =713 ;
$gs['16']['0'] =0; 
$gs['16']['1'] =36;  
$gs['16']['2'] =71;  
$gs['16']['3'] =107 ;  
$gs['16']['4'] =143 ;  
$gs['16']['5'] =178 ;  
$gs['16']['6'] =214 ;  
$gs['16']['7'] =250 ;  
$gs['16']['8'] =285 ;  
$gs['16']['9'] =321 ;  
$gs['16']['10'] =357 ;  
$gs['16']['11'] =392 ;  
$gs['16']['12'] =428 ;
//********************//
$gs['17']['c'] =17 ;
$gs['17']['ifc'] =1500 ;
$gs['17']['i'] =762 ;
$gs['17']['0'] =0;   
$gs['17']['1'] =38;  
$gs['17']['2'] =76;  
$gs['17']['3'] =114 ;  
$gs['17']['4'] =152 ;  
$gs['17']['5'] =191 ;  
$gs['17']['6'] =229 ;  
$gs['17']['7'] =267 ;  
$gs['17']['8'] =305 ;  
$gs['17']['9'] =343 ;  
$gs['17']['10'] =381 ;  
$gs['17']['11'] =419 ;  
$gs['17']['12'] =457 ;
//********************//
$gs['hc1']['c'] =171 ;
$gs['hc1']['ifc'] =0 ;
$gs['hc1']['i'] =930 ; 
$gs['hc1']['0'] =0; 
$gs['hc1']['1'] =47;  
$gs['hc1']['2'] =93;  
$gs['hc1']['3'] =140 ;  
$gs['hc1']['4'] =186 ;  
$gs['hc1']['5'] =233 ;  
$gs['hc1']['6'] =279 ;  
$gs['hc1']['7'] =326 ;  
$gs['hc1']['8'] =372 ;  
$gs['hc1']['9'] =419 ;  
$gs['hc1']['10'] =465 ;  
$gs['hc1']['11'] =512 ;  
$gs['hc1']['12'] =558 ;
//********************//
$gs['hc2']['c'] =172;
$gs['hc2']['ifc'] =0 ;
$gs['hc2']['i'] =990 ;
$gs['hc2']['0'] =0;   
$gs['hc2']['1'] =50;  
$gs['hc2']['2'] =99;  
$gs['hc2']['3'] =149 ;  
$gs['hc2']['4'] =198 ;  
$gs['hc2']['5'] =248 ;  
$gs['hc2']['6'] =297 ;  
$gs['hc2']['7'] =347 ;  
$gs['hc2']['8'] =396 ;  
$gs['hc2']['9'] =446 ;  
$gs['hc2']['10'] =495 ;  
$gs['hc2']['11'] =545 ;  
$gs['hc2']['12'] =594 ;
//********************//
$gs['hc3']['c'] =173 ;
$gs['hc3']['ifc'] =0 ;
$gs['hc3']['i'] =1055 ;
$gs['hc3']['0'] =0;  
$gs['hc3']['1'] =53;  
$gs['hc3']['2'] =106;  
$gs['hc3']['3'] =158 ;  
$gs['hc3']['4'] =211 ;  
$gs['hc3']['5'] =264 ;  
$gs['hc3']['6'] =317 ;  
$gs['hc3']['7'] =369 ;  
$gs['hc3']['8'] =422 ;  
$gs['hc3']['9'] =475 ;  
$gs['hc3']['10'] =528 ;  
$gs['hc3']['11'] =580 ;  
$gs['hc3']['12'] =633 ;
//********************//
$gs['hc4']['c'] =174 ;
$gs['hc4']['ifc'] =0 ;
$gs['hc4']['i'] =1125 ; 
$gs['hc4']['0'] =0; 
$gs['hc4']['1'] =56;  
$gs['hc4']['2'] =113;  
$gs['hc4']['3'] =169 ;  
$gs['hc4']['4'] =225 ;  
$gs['hc4']['5'] =281 ;  
$gs['hc4']['6'] =338 ;  
$gs['hc4']['7'] =394 ;  
$gs['hc4']['8'] =450 ;  
$gs['hc4']['9'] =506 ;  
$gs['hc4']['10'] =563 ;  
$gs['hc4']['11'] =619 ;  
$gs['hc4']['12'] =675 ;
//********************//
$gs['hc5']['c'] =175 ;
$gs['hc5']['ifc'] =0 ;
$gs['hc5']['i'] =1200 ; 
$gs['hc5']['0'] =0;
$gs['hc5']['1'] =60;  
$gs['hc5']['2'] =120;  
$gs['hc5']['3'] =180 ;  
$gs['hc5']['4'] =240 ;  
$gs['hc5']['5'] =300 ;  
$gs['hc5']['6'] =360 ;  
$gs['hc5']['7'] =420 ;  
$gs['hc5']['8'] =480 ;  
$gs['hc5']['9'] =540 ;  
$gs['hc5']['10'] =600 ;  
$gs['hc5']['11'] =660 ;  
$gs['hc5']['12'] =720 ;

//********************//
$gs['hc6']['c'] =176 ;
$gs['hc6']['ifc'] =0 ;
$gs['hc6']['i'] =1280 ;
$gs['hc6']['0'] =0;  
$gs['hc6']['1'] =64;  
$gs['hc6']['2'] =128;  
$gs['hc6']['3'] =192 ;  
$gs['hc6']['4'] =256 ;  
$gs['hc6']['5'] =320 ;  
$gs['hc6']['6'] =384 ;  
$gs['hc6']['7'] =448 ;  
$gs['hc6']['8'] =512 ;  
$gs['hc6']['9'] =576 ;  
$gs['hc6']['10'] =640 ;  
$gs['hc6']['11'] =704 ;  
$gs['hc6']['12'] =768 ;

//********************//
$gs['hc7']['c'] =177 ;
$gs['hc7']['ifc'] =0 ;
$gs['hc7']['i'] =1480 ;
$gs['hc7']['0'] =0;  
$gs['hc7']['1'] =74;  
$gs['hc7']['2'] =148;  
$gs['hc7']['3'] =222 ;  
$gs['hc7']['4'] =296 ;  
$gs['hc7']['5'] =370 ;  
$gs['hc7']['6'] =444 ;  
$gs['hc7']['7'] =518 ;  
$gs['hc7']['8'] =592 ;  
$gs['hc7']['9'] =666 ;  
$gs['hc7']['10'] =740 ;  
$gs['hc7']['11'] =814 ;  
$gs['hc7']['12'] =888 ;

//********************//
return $gs[$h][$v] ;
 }





//***************************post*************************//$_POST["idg"];
$idstatut=$_POST["idstatut"];
$idg=$_POST["idg"];
$idp=$_POST["idp"];
$date=date("Y-m-d");
$date1=date("Y");
$HEUR=$_POST["HEUR"];
$DATE=$_POST["DATE"];
$NOM=$_POST["NOM"];
$PRENOM=$_POST["PRENOM"];
$GRADE=$_POST["GRADE"];
//*************************//

$NDECISION=$_POST["NDECISION"];
//transforme date euro
$J1 = substr($_POST["DATEDECISION"],0,2);
$M1 = substr($_POST["DATEDECISION"],3,2);
$A1 = substr($_POST["DATEDECISION"],6,4);
$DATEDECISION=$A1."-".$M1."-".$J1;

$NPV=$_POST["NPV"];
//transforme date euro
$J2 = substr($_POST["DATEPV"],0,2);
$M2 = substr($_POST["DATEPV"],3,2);
$A2 = substr($_POST["DATEPV"],6,4);
$DATEPV=$A2."-".$M2."-".$J2;

$ANNEEPV=$_POST["ANNEEPV"];
$DUREE=$_POST["DUREE"];
$CATEGORIE=$_POST["CATEGORIE"];
$ECHELON=$_POST["ECHELON"];
//transforme date euro
$J3 = substr($_POST["DATEDEFFET"],0,2);
$M3 = substr($_POST["DATEDEFFET"],3,2);
$A3 = substr($_POST["DATEDEFFET"],6,4);
$DATEDEFFET=$A3."-".$M3."-".$J3;


$J4 = substr($_POST["RESTE"],0,2);
$M4 = substr($_POST["RESTE"],3,2);
$A4 = substr($_POST["RESTE"],6,4);



$RESTE=$_POST["RESTE"];
$INDICEB=$_POST["INDICEB"];
$INDICEBV=gs($CATEGORIE,$INDICEB);
$INDICEE=gs($CATEGORIE,$ECHELON) ;
$INDICE=$INDICEBV+$INDICEE;

$SF=$_POST["SF"];
$NSS=$_POST["NSS"];
$NCCP=$_POST["NCCP"];
$NBRENF=$_POST["NBRENF"];

//**************************************************************************//
// create new PDF document
$pdf = new TCPDF('P', 'mm', 'A4', true, 'UTF-8', false);
$pdf->setPrintHeader(false);
$pdf->setPrintFooter(false);
$pdf->SetDisplayMode('fullpage','single');//mode d affichage 
$lg['w_page'] = 'page';
$pdf->setLanguageArray($lg);
$pdf->AddPage();
$pdf->setRTL(true);
$pdf->SetFont('aefurat', '', 18);
//************************CORPS*************************// 
$pdf->Text(60,10,"الجمهورية الجزائرية الديمقراطية الشعبيـة");
$pdf->Text(55,20,"وزارة الصحة و السكان و إصلاح المستشفيات");
$pdf->Text(5,30,"مديرية الصحة و السكان لولاية الجلفة");
$pdf->Text(5,40,"المؤسسة العمومية الاستشفائية عين وسارة");
$pdf->Text(5,50,"المديرية الفرعية للموارد البشرية ");
$pdf->Text(5,60," الرقم: ".$NDECISION." / ".$date1);
//$pdf->Text(35,60,$date1);
$pdf->SetFont('aefurat','', 26);
$pdf->SetXY(15,70);
$pdf->Cell(180,8,"مقرر ترقية فى الدرجة",0,1,'C');
$pdf->SetXY(15,90);
$pdf->SetFont('aefurat', '', 16);
$pdf->Cell(180,8,"إن مدير المؤسسة العمومية الإستشفائية بعين وسارة  ",0,1,'C');
$pdf->Text(5,100,"بمقتضى : الأمر رقم 03-06 المؤرخ في 15 يوليو سنة 2006 المتضمن القانون الأساسي العام  ");
$pdf->Text(25,110,"للوظيفة العمومية .");
$pdf->Text(5,120," بمقتضى : المرسوم التنفيذي رقم 140-07 المؤرخ في 19 ماي سنة 2007 المتضمن إنشاء المؤسسات ");
$pdf->Text(25,130,"العمومية الإستشفائية و المؤسسات العمومية للصحة الجوارية و تنظيمها و سيرها.");


$uc=intval($_POST["idstatut"]);
switch($uc)
{
 case '1' ://specialiste
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 394-09  مؤرخ في 24 نوفمبر 2009 ,المتضمن القانون الأساسي   ");
        $pdf->Text(25,150,"الخاص بالموظفين المنتمين لأسلاك الممارسين الطبيين المختصين  في الصحة العمومية");
		$pdf->Text(5,160," بموجب :المحضر رقم ".$NPV."المؤرخ في  ".$DATEPV."المتضمن المصادقة على جدول الترقية ");
		$pdf->Text(25,170," في الدرجات لسنة "." ".$ANNEEPV."الخاصة برتبة"." ".$GRADE.".");
		break;
		}	   
case '2' ://generaliste medecin pharmacien dentiste
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم  393-09  مؤرخ في 24 نوفمبر سنة 2009 ,المتضمن القانون الأساسي   ");
        $pdf->Text(25,150,"الخاص بالموظفين المنتمين لأسلاك الممارسين الطبيين العامين في الصحة العمومية");
		$pdf->Text(5,160," بموجب :المحضر رقم ".$NPV."المؤرخ في  ".$DATEPV."  المتضمن المصادقة على جدول الترقية ");
		$pdf->Text(25,170," في الدرجات لسنة "."  ".$ANNEEPV."  "."الخاصة برتبة"." ".$GRADE.".");
		break;
		}	    	
case '3' ://paramedicale
		{
		$pdf->Text(5,140," بمقتضى :المرسوم التنفيذي رقم 121-11 مؤرخ في 20 مارس 2011 ,يتضمن القانون الأساسي  ");
        $pdf->Text(25,150,"الخاص بالموظفين المنتمين لأسلاك شبه الطبيين للصحة العمومية .");
		$pdf->Text(5,160," بموجب :المحضر رقم ".$NPV."المؤرخ في  ".$DATEPV."  المتضمن المصادقة على جدول الترقية ");
		$pdf->Text(25,170," في الدرجات لسنة "." ".$ANNEEPV." "."الخاصة برتبة"." ".$GRADE.".");
		break;
		}        
case '4' ://psycholgue
		{
		
        $pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 240-09 المؤرخ في 22 يوليو سنة 2009 ,المتضمن القانون للأساسي ");
		$pdf->Text(25,150,"الخاص بالموظفين المنتمين لأسلاك النفسانيين للصحة العمومية ");
		$pdf->Text(5,160," بموجب :المحضر رقم ".$NPV."المؤرخ في  ".$DATEPV."  المتضمن المصادقة على جدول الترقية ");
		$pdf->Text(25,170," في الدرجات لسنة "." ".$ANNEEPV." "."الخاصة برتبة"." ".$GRADE.".");
		break;
		}        				
case '5' ://sage femme
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 122-11 المؤرخ في 20 مارس سنة 2011 ,المتضمن القانون الأساسي  ");
        $pdf->Text(25,150,"الخاص بالموظفات المنتميات لسلك القابلات في الصحة العمومية");
		$pdf->Text(5,160," بموجب :المحضر رقم ".$NPV."المؤرخ في  ".$DATEPV."  المتضمن المصادقة على جدول الترقية ");
		$pdf->Text(25,170," في الدرجات لسنة "." ".$ANNEEPV." "."الخاصة برتبة"." ".$GRADE.".");
		break;
		}				
case '6' ://biologie
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 152-11 المؤرخ  في 3 ابريل سنة 2011  ,المتضمن القانون الأساسي  ");
        $pdf->Text(5,160," بموجب :المحضر رقم ".$NPV."المؤرخ في  ".$DATEPV."المتضمن المصادقة على جدول الترقية ");
		$pdf->Text(25,170," في الدرجات لسنة "." ".$ANNEEPV." "."الخاصة برتبة"." ".$GRADE.".");
		break;
		}				
case '7' ://annesthesiste
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 235-11 المؤرخ في 3 يوليو سنة 2011 ، المتضمن القانون الأساسي  ");
        $pdf->Text(25,150,"الخاص بالموظفين المنتمين لأسلاك الأعوان الطبيين في التخذير و لإنعاش للصحة العمومية");
		$pdf->Text(5,160," بموجب :المحضر رقم ".$NPV."المؤرخ في  ".$DATEPV."  المتضمن المصادقة على جدول الترقية ");
		$pdf->Text(25,170," في الدرجات لسنة "." ".$ANNEEPV." "."الخاصة برتبة"." ".$GRADE.".");
		break;
		}				
case '8' ://corps communs
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 04-08 مؤرخ في يناير سنة 2008 المتضمن القانون الأساسي  ");
        $pdf->Text(25,150,"الخاص بالموظفين المنتمين للأسلاك المشتركة في المؤسسات و الإدارات العمومية ");
		$pdf->Text(5,160," بموجب :المحضر رقم ".$NPV."المؤرخ في  ".$DATEPV."المتضمن المصادقة على جدول الترقية ");
		$pdf->Text(25,170," في الدرجات لسنة "." ".$ANNEEPV." "."الخاصة برتبة"." ".$GRADE.".");
		break;
		}				
case '9' ://op
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 05-08 مؤرخ في 19 يناير سنة 2008 المتضمن القانون الأساسي  ");
        $pdf->Text(25,150,"الخاص بالموظفين المنتمين للعمال المهنيين و سائقي السيارات و الحجاب  ");
		$pdf->Text(5,160," بموجب :المحضر رقم ".$NPV."المؤرخ في  ".$DATEPV."  المتضمن المصادقة على جدول الترقية ");
		$pdf->Text(25,170," في الدرجات لسنة "." ".$ANNEEPV." "."الخاصة برتبة"." ".$GRADE.".");
		break;
		}				
case '10' ://phisi
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 178-10 المؤرخ في 8 يوليو سنة 2010 المتضمن القانون الأساسي ");
        $pdf->Text(25,150," الخاص بالموظفين المنتمين لسلك الفيزيائيين الطبيين في الصحة العمومية ");
		$pdf->Text(5,160," بموجب :المحضر رقم ".$NPV."المؤرخ في  ".$DATEPV."المتضمن المصادقة على جدول الترقية ");
		$pdf->Text(25,170," في الدرجات لسنة ".$ANNEEPV." "."الخاصة برتبة"." ".$GRADE.".");
		break;
		}				
case '11' ://idmage
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 126-08 المؤرخ في 19 ابريل سنة 2008 المتعلق بجهاز  ");
        $pdf->Text(25,150,"المساعدة على الإدماج المهني ");
		$pdf->Text(5,160," بموجب :المحضر رقم ".$NPV."المؤرخ في  ".$DATEPV."  المتضمن المصادقة على جدول الترقية ");
		$pdf->Text(25,170," في الدرجات لسنة "." ".$ANNEEPV." "."الخاصة برتبة"." ".$GRADE.".");
		break;
		}				
case '12' ://idmage
		{
		$pdf->Text(5,140," بمقتضى : المرسوم الرئاسي رقم 308-07 المؤرخ في 29  سبتمبر سنة 2007 المحدد لكيفيات توظيف");
        $pdf->Text(25,150," الأعوان المتعاقدين و حقوقهم وواجباتهم و العناصرالمشكلة لرواتبهم والقواعد المتعلقة ");
		$pdf->Text(25,160," بتسييرهم و كذا النظام التأديبي المطبق عليهم");
		$pdf->Text(5,160," بموجب :المحضر رقم ".$NPV."المؤرخ في  ".$DATEPV."المتضمن المصادقة على جدول الترقية ");
		$pdf->Text(25,170," في الدرجات لسنة "." ".$ANNEEPV." "."الخاصة برتبة"." ".$GRADE.".");
		break;
		}	
case '13' ://idmage
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 161-09 المؤرخ في 02 ماي سنة 2009 ,المتضمن القانون الأساسي ");
        $pdf->Text(25,150,"الخاص بالموظفين المنتمين لسلك متصرفي مصالح الصحة");
		$pdf->Text(5,160," بموجب :المحضر رقم ".$NPV."المؤرخ في  ".$DATEPV."  المتضمن المصادقة على جدول الترقية ");
		$pdf->Text(25,170," في الدرجات لسنة "." ".$ANNEEPV." "."الخاصة برتبة"." ".$GRADE.".");
		break;
		}	
}
//************************************************************************************************************* 
$pdf->SetFont('aefurat', '', 18);
$pdf->Text(90,180,"يقـــــرر");
$pdf->SetFont('aefurat', '', 16);
$pdf->Text(5,190,"المادة الأولى : (ت) يرقى  السيد (ة):");
$pdf->Text(35,200,"الرتبة:");
$pdf->SetFont('aefurat','I', 17);
$pdf->SetTextColor(225,0,0);
$pdf->Text(77,190,$NOM." ".$PRENOM);
$pdf->Text(50,200,$GRADE);
$pdf->SetTextColor(0,0,0);
$pdf->SetXY(5,210);
$pdf->Cell(25,8,'المدة',1,1,'C');
$pdf->SetXY(30,210);
$pdf->Cell(16,8,'الصنف',1,1,'C');
$pdf->SetXY(46,210);
$pdf->Cell(16,8,'الدرجة',1,1,'C');
$pdf->SetXY(62,210);
$pdf->Cell(40,8,'الرقم الاستدلالى',1,1,'C');
$pdf->SetXY(102,210);
$pdf->Cell(30,8,'تاريخ النفاذ',1,1,'C');
$pdf->SetXY(132,210);
$pdf->Cell(68,8,'الاقدمية المتبقية'.'  '.$ANNEEPV.'/12/31',1,1,'C');
//*********************//
$pdf->SetTextColor(225,0,0);
$pdf->SetXY(5,218);
$pdf->Cell(25,8,$DUREE,1,1,'C');
$pdf->SetXY(30,218);
$pdf->Cell(16,8,$CATEGORIE,1,1,'C');
$pdf->SetXY(46,218);
$pdf->Cell(16,8,$ECHELON,1,1,'C');
$pdf->SetXY(62,218);
$pdf->Cell(40,8,$INDICE,1,1,'C');
$pdf->SetXY(102,218);
$pdf->Cell(30,8,$DATEDEFFET,1,1,'C');


$pdf->SetXY(132,218);
$pdf->Cell(24,8,$A4." سنة ",1,1,'C');
$pdf->SetXY(156,218);
$pdf->Cell(22,8,$M4." شهر ",1,1,'C');
$pdf->SetXY(178,218);
$pdf->Cell(22,8,$J4." يوم ",1,1,'C');


$pdf->SetTextColor(0,0,0);
$pdf->Text(5,230,"المادة الثانية : تكلف السيدة المديرة الفرعية للموارد البشرية و أمين خزينة المؤسسة العمومية ");
$pdf->Text(25,240," الإستشفائية بعين وسارة بتنفيذ هذا المقرر.");
$pdf->Text(140,250," عين وسارة في : ".$DATEDECISION);
$pdf->Text(150,260,"  المدير");
//********************************************//
// la fonction marche bien 
function datePlus($dateDo,$nbrJours)
{$timeStamp = strtotime($dateDo); 
$timeStamp += 24 * 60 * 60 * $nbrJours;
$newDate = date("Y-m-d", $timeStamp);
return  $newDate;
}
$dateDo=$DATEDEFFET;
$nbrJours =912 ;
$PREVISION=datePlus($dateDo,$nbrJours);

$RELIQUAT=$A4."-".$M4."-".$J4;

//***********************************modification service base de donnes *********************************************//
$db_host="localhost";$db_name="grh"; $db_user="root";$db_pass=""; 
$cnx = mysql_connect($db_host,$db_user,$db_pass)or die ('I cannot connect to the database because: ' . mysql_error());  
$db  = mysql_select_db($db_name,$cnx) ;   
mysql_query("SET NAMES 'UTF8' ");
$sql = "UPDATE grh SET
	NDECISION      = '$NDECISION',
    DATEDECISION   = '$DATEDECISION',
    NPV            = '$NPV',
    DATEPV         = '$DATEPV',
    ANNEEPV        = '$ANNEEPV',
    DUREE          = '$DUREE',
    CATEGORIE      = '$CATEGORIE',
    ECHELON        = '$ECHELON',
    DATEDEFFET     = '$DATEDEFFET', 
	INDICEBV       = '$INDICEBV',
	INDICEE        = '$INDICEE',
	INDICE         = '$INDICE',
	PREVISION      = '$PREVISION',
	Situation_familliale = '$SF',
	NSS            = '$NSS',
	NCCP           = '$NCCP',
	RELIQUAT       = '$RELIQUAT',
	NBRENF         = '$NBRENF'
	WHERE idp = '$idp'" ;	
$requete = mysql_query($sql, $cnx) or die( mysql_error() ) ;
//********************************************************************************************************************//



$pdf->Output();




}//fin if 
else
{
    $idp=$_POST["idp"];
    //echo("La modification à echouee redirection ver page") ;
	header("Location: ../index.php?uc=AVANCE&idp=$idp") ;
   
}
?>
