<?php
if( $_POST["DATECONTA"]!="" )
{
require_once('../tcpdf/GRH1.php');
$pdf = new GRH1('P', 'mm', 'A4', true, 'UTF-8', false);
$pdf->entete();
$idstatut=$_POST["idstatut"];
$idp=$_POST["idp"];
$cause=$_POST["DATECONTA"];
$pdf->SetFont('aefurat','', 26);
$pdf->SetXY(15,70);
$pdf->Cell(180,8,"مقـرر التعويض عن خطر العدوى",0,1,'C');
$pdf->SetFont('aefurat', '', 15);

$pdf->SetXY(15,90);
$pdf->Cell(180,8,"إن مدير المؤسسة العمومية الإستشفائية بعين وسارة  ",0,1,'C');
$pdf->Text(5,100,"بمقتضى : الأمر رقم 03-06 المؤرخ في 15 يوليو سنة 2006 المتضمن القانون الأساسي العام  ");
$pdf->Text(25,110,"للوظيفة العمومية .");
$pdf->Text(5,120," بمقتضى : المرسوم التنفيذي رقم 140-07 المؤرخ في 19 ماي سنة 2007 المتضمن إنشاء المؤسسات ");
$pdf->Text(25,130,"العمومية الإستشفائية و المؤسسات العمومية للصحة الجوارية و تنظيمها و سيرها.");
$uc=intval($_POST["idstatut"]);
switch($uc)
{
 case '1' ://specialiste
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 394-09  مؤرخ في 24 نوفمبر 2009 ,المتضمن القانون الأساسي   ");
        $pdf->Text(25,150,"الخاص بالموظفين المنتمين لأسلاك الممارسين الطبيين المختصين  في الصحة العمومية");
		$pdf->Text(5,160," نظـــرا : للمرسوم التنفيذي رقم  194-13 المؤرخ في 20 ماي 2013 المتعلق بالتعويض عن خطر العدوى" );
		$pdf->Text(25,170,"لفائدة مستخدمي المؤسسات العمومية التابعة لقطاع الصحة " );
		break;
		}	   
case '2' ://generaliste medecin pharmacien dentiste
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم  393-09  مؤرخ في 24 نوفمبر سنة 2009 ,المتضمن القانون الأساسي   ");
        $pdf->Text(25,150,"الخاص بالموظفين المنتمين لأسلاك الممارسين الطبيين العامين في الصحة العمومية");
		$pdf->Text(5,160," نظـــرا : للمرسوم التنفيذي رقم  194-13 المؤرخ في 20 ماي 2013 المتعلق بالتعويض عن خطر العدوى" );
		$pdf->Text(25,170,"لفائدة مستخدمي المؤسسات العمومية التابعة لقطاع الصحة " );
		break;
		}	    	
case '3' ://paramedicale
		{
		$pdf->Text(5,140," بمقتضى :المرسوم التنفيذي رقم 121-11 مؤرخ في 20 مارس 2011 ,يتضمن القانون الأساسي  ");
        $pdf->Text(25,150,"الخاص بالموظفين المنتمين لأسلاك شبه الطبيين للصحة العمومية .");
		$pdf->Text(5,160," نظـــرا : للمرسوم التنفيذي رقم  194-13 المؤرخ في 20 ماي 2013 المتعلق بالتعويض عن خطر العدوى" );
		$pdf->Text(25,170,"لفائدة مستخدمي المؤسسات العمومية التابعة لقطاع الصحة " );
		break;
		}        
case '4' ://psycholgue
		{
	    $pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 240-09 المؤرخ في 22 يوليو سنة 2009 ,المتضمن القانون للأساسي ");
        $pdf->Text(25,150,"الخاص بالموظفين المنتمين لأسلاك النفسانيين للصحة العمومية ");
		$pdf->Text(5,160," نظـــرا : للمرسوم التنفيذي رقم  194-13 المؤرخ في 20 ماي 2013 المتعلق بالتعويض عن خطر العدوى" );
		$pdf->Text(25,170,"لفائدة مستخدمي المؤسسات العمومية التابعة لقطاع الصحة " );
		break;
		}        				
case '5' ://sage femme
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 122-11 المؤرخ في 20 مارس سنة 2011 ,المتضمن القانون الأساسي  ");
        $pdf->Text(25,150,"الخاص بالموظفات المنتميات لسلك القابلات في الصحة العمومية");
		$pdf->Text(5,160," نظـــرا : للمرسوم التنفيذي رقم  194-13 المؤرخ في 20 ماي 2013 المتعلق بالتعويض عن خطر العدوى" );
		$pdf->Text(25,170,"لفائدة مستخدمي المؤسسات العمومية التابعة لقطاع الصحة " );
		break;
		}				
case '6' ://biologie
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 152-11 المؤرخ  في 3 ابريل سنة 2011  ,المتضمن القانون الأساسي  ");
        $pdf->Text(25,150,"الخاص بالموظفين المنتمين لأسلاك البيولوجيين في الصحة العمومية ");
		$pdf->Text(5,160," نظـــرا : للمرسوم التنفيذي رقم  194-13 المؤرخ في 20 ماي 2013 المتعلق بالتعويض عن خطر العدوى" );
		$pdf->Text(25,170,"لفائدة مستخدمي المؤسسات العمومية التابعة لقطاع الصحة " );
		break;
		}				
case '7' ://annesthesiste
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 235-11 المؤرخ في 3 يوليو سنة 2011 ، المتضمن القانون الأساسي  ");
        $pdf->Text(25,150,"الخاص بالموظفين المنتمين لأسلاك الأعوان الطبيين في التخذير و لإنعاش للصحة العمومية");
		$pdf->Text(5,160," نظـــرا : للمرسوم التنفيذي رقم  194-13 المؤرخ في 20 ماي 2013 المتعلق بالتعويض عن خطر العدوى" );
		$pdf->Text(25,170,"لفائدة مستخدمي المؤسسات العمومية التابعة لقطاع الصحة " );
		break;
		}				
case '8' ://corps communs
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 04-08 مؤرخ في يناير سنة 2008 المتضمن القانون الأساسي  ");
        $pdf->Text(25,150,"الخاص بالموظفين المنتمين للأسلاك المشتركة في المؤسسات و الإدارات العمومية ");
		$pdf->Text(5,160," نظـــرا : للمرسوم التنفيذي رقم  194-13 المؤرخ في 20 ماي 2013 المتعلق بالتعويض عن خطر العدوى" );
		$pdf->Text(25,170,"لفائدة مستخدمي المؤسسات العمومية التابعة لقطاع الصحة " );
		break;
		}				
case '9' ://op
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 05-08 مؤرخ في 19 يناير سنة 2008 المتضمن القانون الأساسي  ");
        $pdf->Text(25,150,"الخاص بالموظفين المنتمين للعمال المهنيين و سائقي السيارات و الحجاب  ");
		$pdf->Text(5,160," نظـــرا : للمرسوم التنفيذي رقم  194-13 المؤرخ في 20 ماي 2013 المتعلق بالتعويض عن خطر العدوى" );
		$pdf->Text(25,170,"لفائدة مستخدمي المؤسسات العمومية التابعة لقطاع الصحة " );
		break;
		}				
case '10' ://phisi
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 178-10 المؤرخ في 8 يوليو سنة 2010 المتضمن القانون الأساسي ");
        $pdf->Text(25,150," الخاص بالموظفين المنتمين لسلك الفيزيائيين الطبيين في الصحة العمومية ");
		$pdf->Text(5,160," نظـــرا : للمرسوم التنفيذي رقم  194-13 المؤرخ في 20 ماي 2013 المتعلق بالتعويض عن خطر العدوى" );
		$pdf->Text(25,170,"لفائدة مستخدمي المؤسسات العمومية التابعة لقطاع الصحة " );
		break;
		}				
case '11' ://idmage
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 126-08 المؤرخ في 19 ابريل سنة 2008 المتعلق بجهاز  ");
        $pdf->Text(25,150,"المساعدة على الإدماج المهني ");
		$pdf->Text(5,160," نظـــرا : للمرسوم التنفيذي رقم  194-13 المؤرخ في 20 ماي 2013 المتعلق بالتعويض عن خطر العدوى" );
		$pdf->Text(25,170,"لفائدة مستخدمي المؤسسات العمومية التابعة لقطاع الصحة " );
		break;
		}				
case '12' ://idmage
		{
		$pdf->Text(5,140," بمقتضى : المرسوم الرئاسي رقم 308-07 المؤرخ في 29  سبتمبر سنة 2007 المحدد لكيفيات توظيف");
        $pdf->Text(25,150," الأعوان المتعاقدين و حقوقهم وواجباتهم و العناصرالمشكلة لرواتبهم والقواعد المتعلقة ");
		$pdf->Text(25,160," بتسييرهم و كذا النظام التأديبي المطبق عليهم");
		$pdf->Text(5,170," نظـــرا : للمرسوم التنفيذي رقم  194-13 المؤرخ في 20 ماي 2013 المتعلق بالتعويض عن خطر العدوى" );
		$pdf->Text(25,180,"لفائدة مستخدمي المؤسسات العمومية التابعة لقطاع الصحة " );
		break;
		}	
case '13' ://idmage
		{
		$pdf->Text(5,140," بمقتضى : المرسوم التنفيذي رقم 161-09 المؤرخ في 02 ماي سنة 2009 ,المتضمن القانون الأساسي ");
        $pdf->Text(25,150,"الخاص بالموظفين المنتمين لسلك متصرفي مصالح الصحة");
		$pdf->Text(5,160," نظـــرا : للمرسوم التنفيذي رقم  194-13 المؤرخ في 20 ماي 2013 المتعلق بالتعويض عن خطر العدوى" );
		$pdf->Text(25,170,"لفائدة مستخدمي المؤسسات العمومية التابعة لقطاع الصحة " );
		break;
		}	
}
$pdf->SetFont('aefurat', '', 18);
$pdf->Text(90,180+10,"يقـــــرر");
$pdf->SetFont('aefurat', '', 16);
$pdf->Text(5,190+10,"المادة الأولى  : (ت) يستفيد السيد (ة)  ");
$pdf->Text(35,200+10,"بصفته (ها)");
$pdf->Text(35,220,"من التعويض عن خطر العدوى المقدر بـ ".$_POST["CONTA"]." دج "." إبتداء من ".$_POST["DATECONTA"]);  
$pdf->Text(5,230,"المادة الثانية :تكلف السيدة المديرة الفرعية للموارد البشرية و امين خزينة المؤسسة العمومية ");
$pdf->Text(25,240,"الإستشفائية بعين وسارة بتنفيذ هذا المقرر.");
$pdf->Text(140,250," عين وسارة في :  ");
//$pdf->Text(175,250,date("Y-m-d"));
$pdf->Text(150,260,"  المدير");
$pdf->SetFont('aefurat','I', 17);
$pdf->SetTextColor(225,0,0);
$pdf->Text(80,190+10,$_POST["NOM"]." ".$_POST["PRENOM"]);
$pdf->Text(60,200+10,$_POST["GRADE"]);


// UPDATE DANS LA BASE DE DONNEES        CONTAG
$pdf->mysqlconnect();
$CONTAG=$_POST["CONTA"];
	$sql = "UPDATE grh SET
	CONTAG   = '$CONTAG'
	WHERE idp = '$idp'" ;
$requete = mysql_query($sql) or die( mysql_error() ) ;
$pdf->Output();
}//fin if 
else
{
$idp=$_POST["idp"];
header("Location: ../index.php?uc=CONTAG&idp=$idp") ;
   
}
?>
